Reports/МИКО_стПанельОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>МИКО_стПанельОтчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекНовый</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекВариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяРасшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/МИКО_стПанельОтчетов/Forms/ФормаОтчета/Ext/Form/Module.bsl
// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Заполним таблицу списков вариантов отчетами со статистикой звонков.
	ОтчетОбъект = Отчеты.МИКО_стСводныеПоказателиПоЗвонкам.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);

	ОтчетОбъект = Отчеты.МИКО_стСтатистикаИсторииЗвонков.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);
	
	ОтчетОбъект = Отчеты.МИКО_стРаспределениеЗвонковПоВремени.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);

	ОтчетОбъект = Отчеты.МИКО_стРаспределениеЗвонковПоОператорам.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);
	
	ОтчетОбъект = Отчеты.МИКО_стАнализПропущенныхЗвонков.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);
	
	ОтчетОбъект = Отчеты.МИКО_стСреднееВремяОжидание.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);

	ОтчетОбъект = Отчеты.МИКО_стРаспределениеЗвонковПоРегионам.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);
	
	// ОтчетОбъект = Отчеты.МИКО_РаспределениеЗвонковПоКонтрагентам.Создать(); //.
	// ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект); //.
	
	ОтчетОбъект = Отчеты.МИКО_стЗвонкиБезДокументаСобытие.Создать();
	ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект);
	
	РеквизитОбъект = РеквизитФормыВЗначение("Отчет");
	ИмяФормыРасшифровки = РеквизитОбъект.Метаданные().ПолноеИмя() + ".Форма.ФормаРасшифровки";
	

	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСписковВариантов(ОтчетОбъект)

	ВариантыОтчета = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек;
	АдресСКД = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	
	Для каждого Вариант Из ВариантыОтчета Цикл
		СтрокаТЗ = СписокВариантов.Добавить();
		СтрокаТЗ.ИмяОтчета 				= ОтчетОбъект.Метаданные().Имя;
		СтрокаТЗ.ИмяВарианта			= Вариант.Имя;
		СтрокаТЗ.ПредставлениеВарианта	= Вариант.Представление;
		СтрокаТЗ.АдресСКД				= АдресСКД;
	КонецЦикла;

КонецПроцедуры // ()

&НаСервере
Процедура ПереопределитьОтчетНаСервере(ТекущиеДанные)
	
	ИмяОтчета 				= ТекущиеДанные.ИмяОтчета;
	ИмяВарианта 			= ТекущиеДанные.ИмяВарианта;
	АдресСКД 				= ТекущиеДанные.АдресСКД;
	ПредставлениеВарианта 	= ТекущиеДанные.ПредставлениеВарианта;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресСКД) Тогда
		Возврат;
	КонецЕсли; 
	
	Отчет.АдресСКД = АдресСКД;
	
	ИсходныйОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСКД);
	
	Отчет.КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки);
	
	ЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));

	ЗначениеПараметра.Значение = ПредставлениеВарианта;
	ЗначениеПараметра.Использование = Истина;
	
	Отчет.КомпоновщикНастроекНовый = Новый КомпоновщикНастроекКомпоновкиДанных;
	Отчет.КомпоновщикНастроекНовый.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	Отчет.КомпоновщикНастроекНовый.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.Настройки);
	
КонецПроцедуры // ()

&НаКлиенте
Процедура СписокВариантовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СкомпоноватьОтчетОбщий(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СкомпоноватьОтчетПриСтарте(ТекущиеДанные)
	
	СкомпоноватьОтчетОбщий(СписокВариантов[0]);
	
КонецПроцедуры // СкомпоноватьОтчетПриСтарте()

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие, ПараметрВыполненногоДействия;
	
	СтандартнаяОбработка = ложь;

	Если ДанныеРасшифровки = Неопределено Тогда 
		Возврат 
	КонецЕсли;

	Если НЕ ЭтоАдресВременногоХранилища(Отчет.АдресСКД) Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСКД));
	
	врОбработкаРасшифровки = Вычислить("ОбработкаРасшифровки");
	Если ВерсияПлатформы = "8.3" Тогда
		Если НЕ ИспользоватьРежимМодальности Тогда
		
			ОписаниеОповещенияРасшифровки = Вычислить("Новый ОписаниеОповещения(""ВыполнитьРасшифровкуОтчета"", ЭтаФорма, Расшифровка)");
			врОбработкаРасшифровки.ПоказатьВыборДействия(ОписаниеОповещенияРасшифровки, Расшифровка);		
		Иначе	
			врОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыполненноеДействие, ПараметрВыполненногоДействия);
	
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
				
			ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда	
				ОткрытьЗначение(ПараметрВыполненногоДействия);	
			Иначе
				ОткрытьФорму(ИмяФормыРасшифровки, Новый Структура("Расшифровка,АдресСхемыКомпоновкиДанных, СформироватьПриОткрытии", Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Расшифровка, ПараметрВыполненногоДействия), Отчет.АдресСКД, Истина), , Истина);
			КонецЕсли;
		КонецЕсли; 
			
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		
		врОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыполненноеДействие, ПараметрВыполненногоДействия);
	
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
			
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда	
			ОткрытьЗначение(ПараметрВыполненногоДействия);	
		Иначе
			ОткрытьФорму(ИмяФормыРасшифровки, Новый Структура("Расшифровка, АдресСхемыКомпоновкиДанных, СформироватьПриОткрытии", Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Расшифровка, ПараметрВыполненногоДействия), Отчет.АдресСКД, Истина), , Истина);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкомпоноватьОтчетПриСтарте(СписокВариантов[0]);

КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиИзХранилища(ИмяОтчета, ИмяВарианта)

	КлючНастройки = ИмяОтчета+"/"+ИмяВарианта;
	
	ПользовНастройки = ХранилищеПользовательскихНастроекОтчетов.Загрузить (КлючНастройки);
	
	Возврат ПользовНастройки;

КонецФункции // ПолучитьНастройкиИзХранилища()

&НаКлиенте
Процедура СкомпоноватьОтчетОбщий(ТекущиеДанные)

	СтруктураДанных = Новый Структура("ИмяОтчета, ИмяВарианта, АдресСКД, ПредставлениеВарианта",
				ТекущиеДанные.ИмяОтчета,ТекущиеДанные.ИмяВарианта,ТекущиеДанные.АдресСКД, ТекущиеДанные.ПредставлениеВарианта);
				
	ПереопределитьОтчетНаСервере(СтруктураДанных);
	
	ИнициализироватьКомпоновщикНастроекНаСервере();
	
	// Восстановим сохраненные пользовательские настройки.
	ПользовНастройки = ПолучитьНастройкиИзХранилища(ТекущиеДанные.ИмяОтчета,ТекущиеДанные.ИмяВарианта);
	Если ПользовНастройки<>Неопределено 
		И ТипЗнч(ПользовНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
	
		Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовНастройки);
	
	КонецЕсли;
	
	Отчет.ТекВариант 		= СтруктураДанных.ИмяВарианта;
	Отчет.ТекОтчет 			= СтруктураДанных.ИмяОтчета;
	
	СкомпоноватьРезультат();

КонецПроцедуры // СкомпоноватьОтчетОбщий()

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроекНаСервере()

	Отчет.КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСКД));
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.КомпоновщикНастроекНовый.ПолучитьНастройки());

КонецПроцедуры // ИнициализироватьКомпоновщикНастроекНаСервере()

&НаКлиенте
Процедура ВыполнитьРасшифровкуОтчета(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт

	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет ИЛИ ВыполненноеДействие = Неопределено Тогда
		
	ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		
		Если ВерсияПлатформы = "8.3" Тогда
		
			Если НЕ ИспользоватьРежимМодальности Тогда
				Попытка
					Выполнить("ПоказатьЗначение(,ПараметрВыполненногоДействия)");
				Исключение
					Возврат;
				КонецПопытки;
			Иначе	
				ОткрытьЗначение(ПараметрВыполненногоДействия);
			КонецЕсли; 
				
		ИначеЕсли ВерсияПлатформы = "8.2" Тогда
			
			ОткрытьЗначение(ПараметрВыполненногоДействия);
			
		КонецЕсли; 

	Иначе
		
		Если ТипЗнч(ДополнительныеПараметры) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
			
			Расшифровка = ДополнительныеПараметры;
			ПараметрыФормы = Новый Структура("Расшифровка, АдресСхемыКомпоновкиДанных, СформироватьПриОткрытии", Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Расшифровка, ПараметрВыполненногоДействия), Отчет.АдресСКД, Истина);
						
			ОткрытьФорму(ИмяФормыРасшифровки, ПараметрыФормы,,Истина);
			
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры // ВыполнитьРасшифровкуОтчета()

// #КонецОбласти
